gcask/the-pit/firmware/hardware/thepit/avr/boards.txt
thepit.name=The Pit (Leonardo)
thepit.vid.0=0x2341
thepit.pid.0=0x0036
thepit.vid.1=0x2341
thepit.pid.1=0x8036
thepit.vid.2=0x2A03
thepit.pid.2=0x0036
thepit.vid.3=0x2A03
thepit.pid.3=0x8036
thepit.upload_port.0.vid=0x2341
thepit.upload_port.0.pid=0x0036
thepit.upload_port.1.vid=0x2341
thepit.upload_port.1.pid=0x8036
thepit.upload_port.2.vid=0x2A03
thepit.upload_port.2.pid=0x0036
thepit.upload_port.3.vid=0x2A03
thepit.upload_port.3.pid=0x8036
thepit.upload_port.4.board=arduino:leonardo

thepit.upload.tool=arduino:avrdude
thepit.upload.tool.default=arduino:avrdude
thepit.upload.tool.network=arduino:arduino_ota
thepit.upload.protocol=avr109
thepit.upload.maximum_size=28672
thepit.upload.maximum_data_size=2560
thepit.upload.speed=57600
thepit.upload.disable_flushing=true
thepit.upload.use_1200bps_touch=true
thepit.upload.wait_for_upload_port=true

thepit.bootloader.tool=arduino:avrdude
thepit.bootloader.tool.default=arduino:avrdude
thepit.bootloader.low_fuses=0xff
thepit.bootloader.high_fuses=0xd8
thepit.bootloader.extended_fuses=0xcb
thepit.bootloader.file=caterina/Caterina-Leonardo.hex
thepit.bootloader.unlock_bits=0x3F
thepit.bootloader.lock_bits=0x2F

thepit.build.mcu=atmega32u4
thepit.build.f_cpu=16000000L
thepit.build.vid=0x2341
thepit.build.pid=0x6cc6
thepit.build.usb_product="The Pit"
thepit.build.board=AVR_LEONARDO
thepit.build.core=arduino:arduino
thepit.build.variant=arduino:leonardo
thepit.build.extra_flags={build.usb_flags} -DCDC_DISABLED -DHID_HIDE_LAYOUT_PRAGMA_MESSAGE -std=gnu++1z